; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v8 ?v6)
             (pred_2 ?v11 ?v7)
             (pred_5 ?v8 ?v7)
             (pred_10 ?v2 ?v8 )
	     (pred_1 ?v8)
             (pred_11 ?v9)
             (pred_12 ?v11)
             (pred_7 ?v7)
             (pred_4 ?v8)
             (pred_3 ?v11)
             (pred_6 ?v8)
             (pred_9 ))



(:action op_3
:parameters (?v1 ?v10 ?v12 ?v3)
:precondition (and (pred_11 ?v1) (pred_11 ?v10) (pred_12 ?v12) (pred_7 ?v3)
          (pred_8 ?v1 ?v10) (pred_2 ?v12 ?v3)
                   (pred_5 ?v10 ?v3) (pred_1 ?v1) 
                   (pred_4 ?v10) (pred_3 ?v12))
:effect (and  (pred_6 ?v10) (not (pred_4 ?v10))))


(:action op_4
:parameters (?v1 ?v13)
:precondition (and (pred_11 ?v1) (pred_11 ?v13)
               (pred_1 ?v1) (pred_8 ?v1 ?v13) (pred_6 ?v13))
:effect (and (pred_1 ?v13) (not (pred_1 ?v1))))

(:action op_1
:parameters (?v1 ?v12)
:precondition (and (pred_11 ?v1) (pred_12 ?v12) 
                  (pred_1 ?v1) (pred_10 ?v12 ?v1) (pred_9 ))
:effect (and (pred_3 ?v12)
   (not (pred_10 ?v12 ?v1)) (not (pred_9 ))))


(:action op_2
:parameters (?v1 ?v4 ?v5)
:precondition (and (pred_11 ?v1) (pred_12 ?v4) (pred_12 ?v5)
                  (pred_1 ?v1) (pred_3 ?v5) (pred_10 ?v4 ?v1))
:effect (and (pred_3 ?v4) (pred_10 ?v5 ?v1)
        (not (pred_3 ?v5)) (not (pred_10 ?v4 ?v1))))

(:action op_5
:parameters (?v1 ?v12)
:precondition (and (pred_11 ?v1) (pred_12 ?v12) 
                  (pred_1 ?v1) (pred_3 ?v12))
:effect (and (pred_9 ) (pred_10 ?v12 ?v1) (not (pred_3 ?v12)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_07 obj_11 obj_17 obj_15 obj_06 obj_13 obj_01 obj_19 obj_08 obj_12 obj_20 obj_03 obj_10 obj_04 obj_05 obj_16
    obj_18 obj_02
    obj_09 obj_14
    )

    (:init
       (pred_9)

       (pred_11 obj_07)
       (pred_11 obj_11)
       (pred_11 obj_17)
       (pred_11 obj_15)
       (pred_11 obj_06)
       (pred_11 obj_13)
       (pred_11 obj_01)
       (pred_11 obj_19)
       (pred_11 obj_08)
       (pred_11 obj_12)
       (pred_11 obj_20)
       (pred_11 obj_03)
       (pred_11 obj_10)
       (pred_11 obj_04)
       (pred_11 obj_05)
       (pred_11 obj_16)
       (pred_7 obj_18)
       (pred_7 obj_02)
       (pred_12 obj_09)
       (pred_12 obj_14)

       (pred_8 obj_07 obj_06)
       (pred_8 obj_07 obj_11)
       (pred_8 obj_11 obj_13)
       (pred_8 obj_11 obj_17)
       (pred_8 obj_11 obj_07)
       (pred_8 obj_17 obj_01)
       (pred_8 obj_17 obj_15)
       (pred_8 obj_17 obj_11)
       (pred_8 obj_15 obj_19)
       (pred_8 obj_15 obj_17)
       (pred_8 obj_06 obj_08)
       (pred_8 obj_06 obj_13)
       (pred_8 obj_06 obj_07)
       (pred_8 obj_13 obj_12)
       (pred_8 obj_13 obj_01)
       (pred_8 obj_13 obj_11)
       (pred_8 obj_13 obj_06)
       (pred_8 obj_01 obj_20)
       (pred_8 obj_01 obj_19)
       (pred_8 obj_01 obj_17)
       (pred_8 obj_01 obj_13)
       (pred_8 obj_19 obj_03)
       (pred_8 obj_19 obj_15)
       (pred_8 obj_19 obj_01)
       (pred_8 obj_08 obj_10)
       (pred_8 obj_08 obj_12)
       (pred_8 obj_08 obj_06)
       (pred_8 obj_12 obj_04)
       (pred_8 obj_12 obj_20)
       (pred_8 obj_12 obj_13)
       (pred_8 obj_12 obj_08)
       (pred_8 obj_20 obj_05)
       (pred_8 obj_20 obj_03)
       (pred_8 obj_20 obj_01)
       (pred_8 obj_20 obj_12)
       (pred_8 obj_03 obj_16)
       (pred_8 obj_03 obj_19)
       (pred_8 obj_03 obj_20)
       (pred_8 obj_10 obj_04)
       (pred_8 obj_10 obj_08)
       (pred_8 obj_04 obj_05)
       (pred_8 obj_04 obj_12)
       (pred_8 obj_04 obj_10)
       (pred_8 obj_05 obj_16)
       (pred_8 obj_05 obj_20)
       (pred_8 obj_05 obj_04)
       (pred_8 obj_16 obj_03)
       (pred_8 obj_16 obj_05)
       (pred_4 obj_15)
       (pred_4 obj_13)
       (pred_5  obj_15 obj_18)
       (pred_5  obj_13 obj_02)
       (pred_6 obj_07)
       (pred_6 obj_11)
       (pred_6 obj_17)
       (pred_6 obj_06)
       (pred_6 obj_01)
       (pred_6 obj_19)
       (pred_6 obj_08)
       (pred_6 obj_12)
       (pred_6 obj_20)
       (pred_6 obj_03)
       (pred_6 obj_10)
       (pred_6 obj_04)
       (pred_6 obj_05)
       (pred_6 obj_16)

       (pred_2  obj_09 obj_18)
       (pred_2  obj_14 obj_02)
       (pred_10 obj_09 obj_01)
       (pred_10 obj_14 obj_20)
       (pred_1 obj_10)
    )

    (:goal (and
       (pred_10 obj_09 obj_17)
    ))
(:constraints
  (always (not (pred_1 obj_12)))
)
)

; plan
1. (op_4 obj_10 obj_08)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_08)
   goals met: 0 of 1
2. (op_4 obj_08 obj_06)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_06)
   goals met: 0 of 1
3. (op_4 obj_06 obj_07)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_07)
   goals met: 0 of 1
4. (op_4 obj_07 obj_11)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_11)
   goals met: 0 of 1
5. (op_4 obj_11 obj_17)
   deleted: (pred_1 obj_11)
   added: (pred_1 obj_17)
   goals met: 0 of 1
6. (op_4 obj_17 obj_01)
   deleted: (pred_1 obj_17)
   added: (pred_1 obj_01)
   goals met: 0 of 1
7. (op_1 obj_01 obj_09)
   deleted: (pred_10 obj_09 obj_01) (pred_9)
   added: (pred_3 obj_09)
   goals met: 0 of 1
8. (op_4 obj_01 obj_17)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_17)
   goals met: 0 of 1
9. (op_5 obj_17 obj_09)
   deleted: (pred_3 obj_09)
   added: (pred_9) (pred_10 obj_09 obj_17)
   goals met: 1 of 1
